"OK" = "确定";
"Back" = "返回";
"Done" = "完成";
"Close" = "关闭";
"Sorry" = "抱歉";
"Cancel" = "取消";
"Setting" = "设置";
"Photos" = "照片";
"Videos" = "视频";
"Preview" = "预览";
"Full image" = "原图";
"Processing..." = "正在处理...";
"Can not use camera" = "无法使用相机";
"Synchronizing photos from iCloud" = "正在从iCloud同步照片";
"Can not choose both video and photo" = "选择照片时不能选择视频";
"Can not choose both photo and GIF" = "选择照片时不能选择 GIF";
"Select the video when in multi state, we will handle the video as a photo" = "多选状态下选择视频，默认将视频当图片发送";
"Can not jump to the privacy settings page, please go to the settings page by self, thank you" = "无法跳转到隐私设置页面，请手动前往设置页面，谢谢";

"Select a maximum of %zd photos" = "你最多只能选择%zd张照片";
"Select a minimum of %zd photos" = "请至少选择%zd张照片";
"Allow %@ to access your album in \"Settings -> Privacy -> Photos\"" = "请在iPhone的\"设置-隐私-照片\"选项中，\r允许%@访问你的手机相册";
"Please allow %@ to access your camera in \"Settings -> Privacy -> Camera\"" = "请在iPhone的\"设置-隐私-相机\"中允许%@访问相机";

"Apply" = "申请";
"Reject" = "拒绝";
"Allow" = "允许";
"Not Allow" = "不允许";

"Use your calendar" = "使用您的日历";

"Obtain your location info" = "获取你的位置信息";
"Obtain your profile photo" = "读取设备上的照片及文件";
"Access and save pictures or videos on device" = "保存图片或视频到你的相册";
"Use your camera" = "使用你的摄像头";
"Use your microphone" = "访问您的麦克风";
"Use your bluetooth" = "使用您的蓝牙";
"Use your addressBook" = "使用你的通讯录";
"Obtain your phoneNumber" = "获取你的手机号码";
"Obtain your userProfile" = "获取你的个人信息";

"Selected for %ld seconds" = "已选取%lds";
"Allow %@ to access your all photos" = "你已设置%@只能访问相册部分照片，建议允许访问「所有照片」";
"Add more accessible photos" = "添加更多\n可访问照片";
"Edit" = "编辑";

"Loading failed, please try again later" = "加载失败，请稍后再试";

"Forward To" = "转发";
"Settings" = "设置";
"Feedback" = "反馈与投诉";
"Restart" = "重新进入\n%@";
"Open Debug" = "打开调试";
"Close Debug" = "关闭调试";
"Share" = "分享";
"Wechat" = "微信好友";
"Add Favorite" = "添加收藏";
"Cancel Favorite" = "取消收藏";
"Add To Desktop" = "添加到桌面";

"Add Favorite Success" = "添加收藏成功";
"Add Favorite Failure" = "添加收藏失败";
"Cancel Favorite Success" = "取消收藏成功";
"Cancel Favorite Failure" = "取消收藏失败";
"Add To Desktop Failure" = "添加到桌面失败";

"%@ Authorizations History" = "%@授权管理";
"No access history of My Information & Authorizations." = "未使用你的个人信息与权限";
"No %@" = "暂无%@";

"Allow \"%@\" to use" = "允许“%@”使用";

"\"%@\"does not use any permissions" = "\"%@\"未使用任何权限";

"Search for location" = "搜索地点";
"Location" = "所在位置";
"Don't show location" = "不显示位置";
"Search nearby" = "搜索附近位置";
"Office Building" = "写字楼";

"User info" = "用户信息";
"Location info" = "位置信息";
"Background Location info" = "后台定位";
"Mobile address book" = "通讯录";
"Microphone" = "麦克风";
"Camera" = "相机";
"Album" = "相册";
"Calendar" = "日历";
"Buletooth" = "蓝牙";
"QR Code" = "二维码/条码";
"License Plate" = "车牌";
"Phone" = "手机号";

"About" = "关于";
"Basic Info" = "基础信息";
"Account" = "账号主体";
"Desc" = "详细描述";
"Version" = "版本号";
"Notes" = "版本说明";
"Labels" = "%@标签";
"Global Privacy Statement" = "服务隐私及数据提示";
"The developer of this Mini-App confirm that it has not processed any information of the user in any way. If there is any subsequent handling of user information, Mini-App Privacy Guidelines will be updated in a timely manner. If you find that the developer has mishandled your privacy information, you may click here to take a issue." = "本%@开发者承诺并保证，未以任何方式处理用户的任何信息。如后续有处理用户信息，会及时更新《%@隐私保护指引》，如果你发现开发者对你的隐私信息进行不当处理，可进行投诉。";
"Statement of Service" = "服务声明";
"statement and" = "和";
"Developers handle your personal information in strict accordance with %@ Privacy Guidelines, and you may take a issue if  you find that a developer has mishandled your private information." = "开发者严格按照%@处理你的个人信息，如果你发现开发者对你的隐私信息进行不当处理，可进行%@。";
"The Mini-App is provided to you by the developer, who assumes full responsibility for the authenticity, legality and validity of the information content, data material and its operation of this service." = "本%@服务由开发者向你提供，开发者对本服务信息内容、数据资料及其运营行为的真实性、合法性及有效性承担全部责任。";
"Instruction" = "第三方用户信息授权说明";
"Privacy Guidelines" = "《%@隐私保护指引》";
"Custom Privacy Guidelines" = "《%@》";
"take a issue" = "投诉";
"App disable feedback function" = "App 禁用了投诉反馈功能";
"Customize Privacy Statement" = "你授权后，%@开发者（包括%@代开发服务商的开发者及%@中使用插件的开发者）将%@，为你提供相关服务。开发者严格按照%@处理你的个人信息，如你发现开发者不当处理你的个人信息，可进行%@。";
"Default Privacy Statement" = "你授权后，%@开发者（包括%@代开发服务商的开发者及%@中使用插件的开发者）将%@，为你提供相关服务。开发者收集、存储、处理或使用用户隐私及数据，应当遵守网络安全法与个人信息保护规范等相关法律法规。若你认为开发者未遵守上述规定或存在其他侵害用户隐私或数据的情况，可进行%@。";
" and %@ others"="和其他%@个";


"Recents" = "最近";
"Save Image" = "保存图片";
"Save Video" = "保存视频";
"Save" = "保存";

"Effective after reopening" = "重新打开后生效";

"Failed to get the picture" = "获取图片失败";
"This device does not have an album" = "该设备无相册";
"Failed to process image" = "处理图像失败";
"No QR code/barcode found" = "未发现二维码/条码";
"No QR code found" = "未发现二维码";
"No barcode found" = "未发现条码";
"No Data Matrix code found" = "未发现Data Matrix码";
"No pdf417 code found" = "未发现pdf417码";
"Only QR codes are supported below iOS 11" = "iOS 11以下只支持识别二维码";
"Please tap to continue" = "请轻触继续";

// page title
"Not Found" = "页面不存在";
"Not Registered" = "非备案域名";
"In The Blacklist" = "黑名单域名";

// title
"Unable to open the page" = "无法打开页面";
"Unable to open this page" = "无法打开域名";

// FATErrorCodeUnknown 9999
"No %@ found in service" = "该服务器下无%@";
// FATErrorCodeAppKeyInvalid 10000
"SDK not initialized or App Key is illegal" = "未初始化SDK或者appKey不合法";
"[%@]parameter missing" = "[%@]参数缺失";
"[%@]App Key is invalid" = "[%@]无效的AppKey";
"[%@]bundleID is not match appKey" = "[%@]bundleID is not match appKey";
// FATErrorCodeInvalidParam 10001
"Parameter is illegal" = "参数不合法";

"Request parameter is illegal" = "request 参数不合法";
"parentVC is illegal" = "parentVC 参数不合法";
"appId is not configured" = "appId 未配置";

"SDK Key is not allowed to open offline %@" = "SDK Key不支持打开离线%@";
"Packages is not configured" = "packages未设置";

"%@ information is empty" = "%@信息为空";
"%@ information encrypted is empty" = "%@信息解密后为空";
"%@ data type error" = "%@数据类型错误";
"%@ type is missing" = "%@类型缺失";
"Unkown %@ type" = "未知的%@类型";
"CodeId is invalid" = "无效的codeId";
"%@ ID is invalid" = "无效的%@ID";
"QR Code form is illegal" = "二维码格式不合法";

"Device type is not supported" = "设备类型暂不支持";
"The number of available devices has reached its maximum" = "当前可用设备数量已达上限";

"The page does not exist. Please contact the developer" = "该页面不存在，请与开发者联系";

// FATErrorCodeDomainInvalid 10002
"ENV verification failed" = "环境信息校验失败";
"%@ domain not initialized" = "当前%@所属环境与SDK初始化环境不一致";
"License domain is invalid" = "license域名校验失败";
"Service is not initialized" = "该服务器未初始化配置";
"The domain %@ is not registered. Please give feedback to developer by taking a functionality issue." = "域名 %@ 未登记，无法打开当前页面，请联系开发者反馈问题。";
"The domain %@ has been blacklisted" = "域名 %@ 已被运营端放入黑名单，无法打开当前页面，请联系开发者反馈问题。";

// FATErrorCodeNetworkNotReach 10003
"Please confirm your network and reopen %@" = "请检查网络后重新进入%@";
"The Internet connection appears to be offline." = "似乎已断开与互联网的连接";
"The request timed out." = "请求超时。";

// FATErrorCodeRequestFail 11000
"Network request failed" = "网络请求失败";
"Request failed" = "服务异常，接口请求失败";
"%@ request failed" = "服务异常，%@详情接口请求失败";
"Foundation library request failed" = "服务异常，基础库详情接口请求失败";
"Batch %@ request failed" = "批量查询%@详情接口请求失败";
"DV request failed" = "服务异常，域名证书请求失败";

// FATErrorCodeResponseDataInvalid 11001
"Foudation library response error" = "服务异常，基础库详情接口数据异常";
"Foudation library response decrypted error" = "服务异常，基础库详情接口返回数据解密出错";
"%@ response error" = "服务异常，%@详情接口返回数据异常";
"%@ response decrypt error" = "服务异常，%@详情接口返回数据解密出错";
"response error" = "服务异常，接口返回数据异常";
"response decrypt error" = "服务异常，接口返回数据解密出错";
"%@ service error, please retry" = "%@服务异常，请稍后再试";
"Batch %@ response error" = "批量查询%@详情接口，返回数据异常";

// FATErrorCodeDownloadURLInvalid 11002
"Download address error" = "下载地址异常";
"Download address of %@ error, downloading failed" = "%@下载地址异常，无法下载";
"AppId is empty, downloading failed" = "AppId为空，无法下载";
"Downloaded address of foundation library error, downloading failed" = "基础库下载地址异常，无法下载";

// FATErrorCodeDownloadDirectoryError 11003
"Extract directory cannot be empty" = "解压目录不能为空";
"Downloading directory error" = "下载目录出错";
"Document name error" = "文件名称出错";
"Document name of foundation library error" = "基础库文件目录异常";
"Storage directory error" = "存储目录异常";

// FATErrorCodeDownloadFail 11004
"Server error, downloading failed" = "服务器异常，下载失败";

// FATErrorCodeResponseDataUnchanged 11005
"Service error, Foundation Library detail API response with empty data" = "服务异常，基础库详情接口返回数据为空";
"Service error, %@ detail API response with empty data" = "服务异常，%@详情接口返回数据为空";
"Service error, API response with empty data" = "服务异常，接口返回数据为空";

// FATErrorCodeZipInvalid 12000
"MD5 file is invalid" = "文件异常，md5值校验失败";
"Unzip file failed" = "文件异常，无法解压";

"Unzip %@ package failed" = "%@压缩包异常，解压失败";
"Copy %@ package failed" = "%@压缩包异常，拷贝失败";
"%@ package is missing" = "%@压缩包异常，文件缺失";

"Unzip foudation library failed" = "基础库解压失败";

"%@ offline pacakge is missing" = "%@离线包不存在";

"Foudation library offline package is missing" = "基础库离线包不存在";
"Unzip foudation library offline package failed" = "基础库离线包解压失败";

// FATErrorCodeCopyResourceFail 12001
"Copy resources to running directory failed" = "拷贝资源至运行目录失败";
"%@ subpackage resources not found" = "%@未找到分包资源";

// FATErrorCodeServiceNotFound 12002
"Service.html is missing, please confirm pakcage is compiled" = "service.html不存在，请检查代码包是否已编译";

// FATErrorCodeNotTrialAccess 13000
"Failed to obtain trial version" = "获取体验版本失败";
"No trial access." = "没有体验权限";
"No trial access. Please contact the administrator." = "抱歉，您没有体验的权限，请联系管理员";
"No access. Please contact the administrator." = "抱歉，您没有权限，请联系管理员";

// FATErrorCodeTrialCanceled 13001
"Preview edition is cancelled" = "体验版本已取消";
"Preview edition is cancelled, please confirm Preview Edition is configured" = "当前体验版本已取消，请重新设置体验版本";

// FATErrorCodeTempExpried 13002
"QR code is expired" = "二维码已过期，请重新获取";

// FATErrorCodeSameAppID 13003
"APP ID is duplicate" = "appId相同";

// FATErrorCodeNotExamineAccess 13005
"No examine access." = "没有审核权限";

// FATErrorCodeNotDevelopAccess 13006
"No develop access." = "没有开发权限";

// FATErrorCodeAppletNotFound 14000
"%@ not found with appId" = "未找到appId指定的%@";

// FATErrorCodeForegroundAppletNotFound 14001
"%@ not found that is running" = "没有找到前台运行的%@";

// FATErrorCodeAppletConsoleNotReady 14002
"console is not ready" = "控制台未准备好";

// Requset API
"FS_APP_ID_NOT_FOUND_T" = "%@打开失败";
"FS_APP_ID_NOT_FOUND_M" = "%@不存在，请检查 AppID";

"FS_APP_IS_FORBIDDEN_T" = "%@不可用";
"FS_APP_IS_FORBIDDEN_M" = "%@被禁用，相关服务暂不可用";

"FS_APP_NOT_ASS_BIND_T" = "%@不可用";
"FS_APP_NOT_ASS_BIND_M" = "%@与本应用的关联关系没有生效，请检查关联关系";

"FS_APP_PAY_EXPIRE_T" = "%@不可用";
"FS_APP_PAY_EXPIRE_M" = "%@已过有效期，相关服务暂不可用";

"FS_APP_SEQUENCE_NOT_FOUND_T" = "%@打开失败";
"FS_APP_SEQUENCE_NOT_FOUND_M" = "%@版本错误";

"FS_BIND_IS_FORBIDDEN_T" = "%@不可用";
"FS_BIND_IS_FORBIDDEN_M" = "BundleID 被禁用，相关服务暂不可用";

"FS_BIND_NOT_FOUND_T" = "服务不可用";
"FS_BIND_NOT_FOUND_M" = "当前应用未在平台备案，请检查 SDK 初始化配置信息";

"FS_BIND_PAY_EXPIRE_T" = "%@不可用";
"FS_BIND_PAY_EXPIRE_M" = "当前应用已过期";

"FS_COOPERATION_TERMINATED_T" = "%@不可用";
"FS_COOPERATION_TERMINATED_M" = "当前应用已经停止合作";

"FS_DB_ERR_T" = "服务不可用";
"FS_DB_ERR_M" = "数据库内部错误";

"FS_GET_DOMAIN_INFO_ERROR_T" = "服务不可用";
"FS_GET_DOMAIN_INFO_ERROR_M" = "获取域名失败，相关服务不可用";

"FS_GET_GROUP_FAILED_T" = "服务不可用";
"FS_GET_GROUP_FAILED_M" = "企业状态校验异常";

"FS_LICENSE_INVALID_ERR_T" = "%@不可用";
"FS_LICENSE_INVALID_ERR_M" = "您当前的 license 异常，请联系管理员处理";

"FS_ORGAN_STATUS_INVALID_T" = "%@不可用";
"FS_ORGAN_STATUS_INVALID_M" = "%@所属企业账号状态异常，请登录平台处理";

"FS_SERVICE_UNAVAILABLE_T" = "%@不可用";
"FS_SERVICE_UNAVAILABLE_M" = "%@已下架，相关服务暂不可用";

"FS_SIGNATURE_SDKKEY_INVAILD_T" = "%@不可用";
"FS_SIGNATURE_SDKKEY_INVAILD_M" = "SDK Key 出错，请联系管理员处理";

"FS_SYSTEM_CALL_T" = "服务不可用";
"FS_SYSTEM_CALL_M" = "系统内部错误";

"OVER_FRQ_LIMIT_T" = "服务不可用";
"OVER_FRQ_LIMIT_M" = "抱歉，由于资源不足，相关服务暂不可用";

"FS_QR_CODE_EXPIRED_T" = "二维码已过期，请重新获取";

"FS_NOT_TRIAL_INFO_T" = "体验版本已取消";
"FS_NOT_TRIAL_INFO_M" = "当前体验版本已取消，请重新设置体验版本";

"FC_TRIAL_USERID_NO_MATCH_T" = "没有体验权限";
"FC_TRIAL_USERID_NO_MATCH_M" = "抱歉，您没有体验的权限，请联系管理员";

"FC_RULE_TRIAL_USERID_NO_MATCH_T" = "没有体验权限";
"FC_RULE_TRIAL_USERID_NO_MATCH_M" = "抱歉，您没有体验的权限，请联系管理员";

"FC_DEV_USERID_NO_MATCH_T" = "没有开发权限";
"FC_DEV_USERID_NO_MATCH_M" = "抱歉，您没有权限，请联系管理员";

"FS_ADMIN_AUTH_ERR_T" = "没有审核权限";
"FS_ADMIN_AUTH_ERR_M" = "抱歉，您没有的权限，请联系管理员";

"Apple Maps" = "苹果地图";
"Baidu Maps" = "百度地图";
"Amap" = "高德地图";
"Google Maps" = "谷歌地图";
"Tencent Maps" = "腾讯地图";
"Navigate to" = "导航到";

"While Using the Mini-App" = "使用%@时";
"While Using the Mini-App and After Leaving" = "使用%@时和离开后";

"Allow While Using the Mini-App" = "使用%@时允许";
"Allow While Using the Mini-App and After Leaving" = "使用%@时和离开后允许";

"Confirm exit the Mini-App" = "确定退出%@";
"Remote debugging parameter is illegal" = "远程调试参数不合法";
"Remote debugging connection disconnected" = "远程调试连接已断开";
"Remote debugging connection failed. Please check the network and try again" = "远程调试连接失败，请检查网络后重试";

"Reminder" = "温馨提示";
"The first %d files selected are valid" = "选择前%d个文件有效";

// toast
"apiServer number exceeds license limit" = "初始化服务器个数超过限制";

"loading"="加载中";
"sdk configuration information is empty"="SDK配置信息为空";

"Locating"="正在定位";
"Using microphone"="正在使用麦克风";

//picker
"picker_year"="年";
"picker_day"="日";
"picker_month_1"="01月";
"picker_month_2"="02月";
"picker_month_3"="03月";
"picker_month_4"="04月";
"picker_month_5"="05月";
"picker_month_6"="06月";
"picker_month_7"="07月";
"picker_month_8"="08月";
"picker_month_9"="09月";
"picker_month_10"="10月";
"picker_month_11"="11月";
"picker_month_12"="12月";

//game keyboard
"keyboard_done"="完成";
"keyboard_next"="下一个";
"keyboard_search"="搜索";
"keyboard_go"="前往";
"keyboard_send"="发送";
